### <b><u> PANDAS

In [3]:
import pandas as pd
import numpy as np

In [4]:
p1=pd.Series([100,200,300],index=['a','b','c'])       # Creating a Pandas Series with custom index
p1

a    100
b    200
c    300
dtype: int64

In [5]:
p1.index=['l','m','n']
p1

l    100
m    200
n    300
dtype: int64

In [6]:
p1[0]                     # Accessing element by position as index which has been changed

C:\Users\DELL\AppData\Local\Temp\ipykernel_17616\3787472092.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  p1[0]                     # Accessing element by position as index which has been changed

np.int64(100)

In [7]:
p1['l']

np.int64(100)

In [8]:
p1.sum()                    # Sum of all elements in the Series

np.int64(600)

In [9]:
p1.min()                    # Minimum element in the Series

np.int64(100)

In [10]:
p1.max()                    # Maximum element in the Series

np.int64(300)

In [11]:
type(p1)                    # Checking the type of p1

pandas.core.series.Series

In [12]:
df1=pd.DataFrame({'Name':['Aaditya','Muskan','Chirag','Vaibhav'],'Marks':[92,98,90,84],'Subjects':['Maths','Physics','Chemistry','Biology']})                             # Creating a Pandas DataFrame
df1

      Name  Marks   Subjects
0  Aaditya     92      Maths
1   Muskan     98    Physics
2   Chirag     90  Chemistry
3  Vaibhav     84    Biology

In [13]:
type(df1)

pandas.core.frame.DataFrame

In [14]:
df1.index                        # Checking the index of the DataFrame

RangeIndex(start=0, stop=4, step=1)

In [15]:
df1.columns                      # Checking the columns of the DataFrame

Index(['Name', 'Marks', 'Subjects'], dtype='object')

In [16]:
df1['Marks']                     # Accessing a column in the DataFrame

0    92
1    98
2    90
3    84
Name: Marks, dtype: int64

In [17]:
type(df1['Marks'])               # Checking the type of the accessed column

pandas.core.series.Series

In [18]:
df1['Name']=['A','M','C','V']   # Modifying a column in the DataFrame
df1

  Name  Marks   Subjects
0    A     92      Maths
1    M     98    Physics
2    C     90  Chemistry
3    V     84    Biology

In [19]:
df1.iloc[0:2,0:2]                   # iloc( row start index: row stop index : step, column start index: column stop index : step) Accessing rows by integer-location based indexing

  Name  Marks
0    A     92
1    M     98

In [20]:
df1.loc[0:2,'Name']                  # loc( row labels , column labels) Accessing rows by label-based indexing

0    A
1    M
2    C
Name: Name, dtype: object

In [21]:
# Create a sample DataFrame
data = {
    'Name': ['Amit', 'Priya', 'Rahul', 'Sneha', 'Karan'],
    'Age': [23, 25, 22, 24, 26],
    'City': ['Delhi', 'Mumbai', 'Pune', 'Bangalore', 'Chennai'],
    'Score': [85, 90, 78, 88, 92]
}

df2 = pd.DataFrame(data, index=['s1', 's2', 's3', 's4', 's5'])
df2

     Name  Age       City  Score
s1   Amit   23      Delhi     85
s2  Priya   25     Mumbai     90
s3  Rahul   22       Pune     78
s4  Sneha   24  Bangalore     88
s5  Karan   26    Chennai     92

In [22]:
df2.iloc[0::2,0::2]

     Name     City
s1   Amit    Delhi
s3  Rahul     Pune
s5  Karan  Chennai

In [23]:
df2.iloc[0:2,0]

s1     Amit
s2    Priya
Name: Name, dtype: object

In [24]:
df2.iloc[0:,[0,2]]               # Accessing specific rows and columns using iloc integer location based indexing

     Name       City
s1   Amit      Delhi
s2  Priya     Mumbai
s3  Rahul       Pune
s4  Sneha  Bangalore
s5  Karan    Chennai

In [25]:
df2.loc['s1':'s3','Name':'City']        # Accessing specific rows and columns using loc location based indexing

     Name  Age    City
s1   Amit   23   Delhi
s2  Priya   25  Mumbai
s3  Rahul   22    Pune

In [26]:
df2.loc['s1':'s3',['Name','City']]

     Name    City
s1   Amit   Delhi
s2  Priya  Mumbai
s3  Rahul    Pune

In [27]:
df2.columns

Index(['Name', 'Age', 'City', 'Score'], dtype='object')

In [28]:
df2['Age']

s1    23
s2    25
s3    22
s4    24
s5    26
Name: Age, dtype: int64

In [29]:
cond=df2['Age']==25
cond

s1    False
s2     True
s3    False
s4    False
s5    False
Name: Age, dtype: bool

In [30]:
X=df2.loc[cond]
X

     Name  Age    City  Score
s2  Priya   25  Mumbai     90

In [31]:
X.loc[:,'Age']=22
X

     Name  Age    City  Score
s2  Priya   22  Mumbai     90

In [32]:
df2.loc[df2['Age']==25,'Age']=22
df2

     Name  Age       City  Score
s1   Amit   23      Delhi     85
s2  Priya   22     Mumbai     90
s3  Rahul   22       Pune     78
s4  Sneha   24  Bangalore     88
s5  Karan   26    Chennai     92

In [33]:
df2.loc[df2['City']=='Mumbai','City']='Kolkata'
df2

     Name  Age       City  Score
s1   Amit   23      Delhi     85
s2  Priya   22    Kolkata     90
s3  Rahul   22       Pune     78
s4  Sneha   24  Bangalore     88
s5  Karan   26    Chennai     92

In [34]:
df2.loc[(df2['Age']>20) & (df2['Age']<=25),'Age']=22
df2

     Name  Age       City  Score
s1   Amit   22      Delhi     85
s2  Priya   22    Kolkata     90
s3  Rahul   22       Pune     78
s4  Sneha   22  Bangalore     88
s5  Karan   26    Chennai     92

In [35]:
date="2025-11-10"
type(date)

str

In [36]:
date=pd.to_datetime(date)
type(date)

pandas._libs.tslibs.timestamps.Timestamp

In [37]:
date.month

11

In [38]:
date.month_name()

'November'